Revit 2027 API
BuiltInFailures.PerformanceFailures.FamilyContainsViewSpecificImports Property
 Family definition contains view-specific imports. Such imports are inaccessible in the project - consider removal.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FamilyContainsViewSpecificImports { get; }
Public Shared ReadOnly Property FamilyContainsViewSpecificImports As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FamilyContainsViewSpecificImports {
	FailureDefinitionId^ get ();
}
static member FamilyContainsViewSpecificImports : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PerformanceFailures Class
Autodesk.Revit.DB Namespace